pablotg43/Riego-ESP8266/src/main.cpp
    if (var == "inputssid")
    {
        return readFile(LittleFS, "/inputssid.txt");
    }
    else if (var == "inputpassword")
    {
        return readFile(LittleFS, "/inputpassword.txt");
    }
    else if (var == "servidor_MQTT")
    {
        return readFile(LittleFS, "/servidor_MQTT.txt");
    }
    else if (var == "puerto_MQTT")
    {
        return readFile(LittleFS, "/puerto_MQTT.txt");
    }
    else if (var == "dispositivo")
    {
        return readFile(LittleFS, "/dispositivo.txt");
    }
    else if (var == "tiempo_inicio")
    {
        return readFile(LittleFS, "/tiempo_inicio.txt");
    }
    else if (var == "duracion_1")
    {
        return readFile(LittleFS, "/duracion_1.txt");
    }
    else if (var == "duracion_2")
    {
        return readFile(LittleFS, "/duracion_2.txt");
    }
    else if (var == "duracion_3")
    {
        return readFile(LittleFS, "/duracion_3.txt");
    }
    else if (var == "duracion_4")
    {
        return readFile(LittleFS, "/duracion_4.txt");
    }
    else if (var == "ciclo")
    {
        return readFile(LittleFS, "/ciclo.txt");
    }
    else if (var == "estado_señal_1")
    {
        if (digitalRead(Salida[0]))
        {
            return "On";
        }
        else
        {
            return "Off";
        }
    }
    else if (var == "estado_señal_2")
    {
        if (digitalRead(Salida[1]))
        {
            return "On";
        }
        else
        {
            return "Off";
        }
    }
    else if (var == "estado_señal_3")
    {
        if (digitalRead(Salida[3]))
        {
            return "On";
        }
        else
        {
            return "Off";
        }
    }
    else if (var == "estado_señal_4")
    {
        if (digitalRead(Salida[4]))
        {
            return "On";
        }
        else
        {
            return "Off";
        }
    }
    else if (var == "estado_wifi")
    {
        if (WiFi.status() == WL_CONNECTED)
        {
            return "Conectada";
        }
        else
        {
            return "Desconectada";
        }
    }
    else if (var == "estado_MQTT")
    {
        if (client.connected())
        {
            return "Conectado";
        }
        else
        {
            return "Desconectado";
        }
    }

    return String();
}

void setup_wifi()
{
    delay(10);

    Serial.println();
    Serial.print("Conectando a red: ");

    Serial.println(ssid);
    WiFi.hostname(nombre_dispositivo);
    WiFi.begin(ssid, password);

    while (WiFi.status() != WL_CONNECTED)
    {
        Serial.print(".");
        delay(250);
    }
    Serial.println("");
    Serial.println("WiFi Conectada");
    Serial.println("Direccion IP: ");
    Serial.println(WiFi.localIP());
}

void Start(int salida)
{
    Serial.println("Cambiando " + nombre_completo_salida[salida] + " a: on");
    digitalWrite(salida, HIGH);
    s1ctext[salida] = "on";
    client.publish(s1c[salida].c_str(), s1ctext[salida].c_str());
}

void Stop(int salida)
{
    Serial.println("Cambiando " + nombre_completo_salida[salida] + " a: off");
    digitalWrite(salida, LOW);
    s1ctext[salida] = "off";
    client.publish(s1c[salida].c_str(), s1ctext[salida].c_str());
}

void s1_on(int i)
{
    start[i]=true;
    proximoEstado();
}

void s1_off()
{
    stop=true;
    proximoEstado();
}

void s2(String j, String tiempo)
{
    int i = j.toInt();
    int duracion = tiempo.toInt();
    String nombre = "/duracion_" + j + ".txt";
    Duracion[i] = duracion * minutos;
    Serial.println("Duracion: " + Duracion[i]);
    writeFile(LittleFS, nombre.c_str(), tiempo.c_str());
}

void s3(String tiempo)
{
    int ciclo = tiempo.toInt();
    Ciclo = ciclo * horas;
    Serial.println("Ciclo: " + Ciclo);
    writeFile(LittleFS, "/ciclo.txt", tiempo.c_str());
    proximoEstado();
}

void s4(String tiempo)
{
    int tiempo_inicio = tiempo.toInt();
    Tiempo_inicio = tiempo_inicio * minutos;
    Serial.println("Tiempo inicio: " + Tiempo_inicio);
    writeFile(LittleFS, "/tiempo_inicio.txt", tiempo.c_str());
    temp_inicio = millis();
    proximoEstado();
}

void callback(char *topic, byte *message, unsigned int length)
{
    Serial.println("");
    Serial.print("Mensaje recibido en topic: ");
    Serial.println(topic);
    Serial.println("Mensaje: ");

    String mensaje;

    for (unsigned int i = 0; i < length; i++)
    {
        Serial.print((char)message[i]);
        mensaje += (char)message[i];
    }

    if (String(topic) == nombre_completo_stop)
    {
        s1_off;
    }
    
    if (String(topic) == nombre_completo_salida[0])
    {
        if (mensaje == "on")
        {
            s1_on(0);
        }
        else if (mensaje == "off")
        {
            s1_off;
        }
    }

    if (String(topic) == nombre_completo_salida[1])
    {
        if (mensaje == "on")
        {
            s1_on(1);
        }
        else if (mensaje == "off")
        {
            s1_off;
        }
    }

    if (String(topic) == nombre_completo_salida[2])
    {
        if (mensaje == "on")
        {
            s1_on(2);
        }
        else if (mensaje == "off")
        {
            s1_off;
        }
    }

    if (String(topic) == nombre_completo_salida[3])
    {
        if (mensaje == "on")
        {
            s1_on(3);
        }
        else if (mensaje == "off")
        {
            s1_off;
        }
    }

    if (String(topic) == nombre_completo_duracion[0])
    {
        s2("0", mensaje);
    }

    if (String(topic) == nombre_completo_duracion[1])
    {
        s2("1", mensaje);
    }

    if (String(topic) == nombre_completo_duracion[2])
    {
        s2("2", mensaje);
    }

    if (String(topic) == nombre_completo_duracion[3])
    {
        s2("3", mensaje);
    }

    if (String(topic) == nombre_completo_ciclo)
    {
        s3(mensaje);
    }

    if (String(topic) == nombre_completo_tiempo_inicio)
    {
        s4(mensaje);
    }
}

void reconnect()
{
    // Loop until we're reconnected

    while (!client.connected())
    {
        Serial.print("Conectando a servidor MQTT...");
        // Attempt to connect
        String clientId = "WemoClient-";
        clientId += String(random(0xffff), HEX);

        if (client.connect(clientId.c_str()))
        {
            Serial.println("Conectado");
            client.publish("Riego_1/Estado", "MQTT conectado");

            Serial.println("");
            Serial.println("Salidas");
            for (int i = 0; i <= 3; i++)
            {
                Serial.println(nombre_completo_salida[i]);
                Serial.println(nombre_completo_duracion[i]);
            }
            Serial.println(nombre_estado);

            Serial.println(nombre_completo_salida_general);
            Serial.println(nombre_completo_ciclo);
            Serial.println(nombre_completo_tiempo_inicio);

            Serial.println("");

            for (int i = 0; i <= 3; i++)
            {
                client.subscribe(nombre_completo_salida[i].c_str(), 1);
                client.subscribe(nombre_completo_duracion[i].c_str(), 1);
            }
            client.subscribe(nombre_completo_salida_general.c_str(), 1);
            client.subscribe(nombre_completo_ciclo.c_str(), 1);
            client.subscribe(nombre_completo_tiempo_inicio.c_str(), 1);
        }
        else
        {
            Serial.print("Fallo, rc=");
            Serial.print(client.state());
            Serial.println(" reintantando en 5 segundos");
            delay(5000);
        }
    }
}

void servidorhttp()
{

