pablotg43/Riego-ESP8266/src/main.cpp
    // Send web page with input fields to client
    server.on("/", HTTP_GET, [](AsyncWebServerRequest *request)
              { request->send_P(200, "text/html", index_html, processor); });

    // Send a GET request to <ESP_IP>/get?inputString=<inputMessage>
    server.on("/get", HTTP_GET, [](AsyncWebServerRequest *request)
              {
      String inputMessage;
      // GET paramssid value on <ESP_IP>/get?inputssid=<inputMessage>
      if (request->hasParam("inputssid")) {
        inputMessage = request->getParam("inputssid")->value();
        writeFile(LittleFS, "/inputssid.txt", inputMessage.c_str());
      }
      // GET parampassword value on <ESP_IP>/get?inputpassword=<inputMessage>
      else if (request->hasParam("inputpassword")) {
        inputMessage = request->getParam("inputpassword")->value();
        writeFile(LittleFS, "/inputpassword.txt", inputMessage.c_str());
      } 
      else if (request->hasParam("servidor_MQTT")) {
        inputMessage = request->getParam("servidor_MQTT")->value();
        writeFile(LittleFS, "/servidor_MQTT.txt", inputMessage.c_str());
      } 
      else if (request->hasParam("puerto_MQTT")) {
        inputMessage = request->getParam("puerto_MQTT")->value();
        writeFile(LittleFS, "/puerto_MQTT.txt", inputMessage.c_str());
      } 
      else if (request->hasParam("dispositivo")) {
        inputMessage = request->getParam("dispositivo")->value();
        writeFile(LittleFS, "/dispositivo.txt", inputMessage.c_str());
      } 
      else if (request->hasParam("tiempo_inicio")) {
        inputMessage = request->getParam("tiempo_inicio")->value();
        writeFile(LittleFS, "/tiempo_inicio.txt", inputMessage.c_str());
      } 
      else if (request->hasParam("duracion")) {
        inputMessage = request->getParam("duracion")->value();
        writeFile(LittleFS, "/duracion.txt", inputMessage.c_str());
      } 
      else if (request->hasParam("ciclo")) {
        inputMessage = request->getParam("ciclo")->value();
        writeFile(LittleFS, "/ciclo.txt", inputMessage.c_str());
      } 
      else if (request->hasParam("reiniciar")) {
        inputMessage = request->getParam("reiniciar")->value();
        if (inputMessage == "1") {
          ESP.restart();
        }
      } 
      else {
        inputMessage = "No message sent";
      }
      Serial.println(inputMessage);
      request->send(200, "text/text", inputMessage); });
    server.onNotFound(notFound);
    server.begin();
}

void setup()
{

    Serial.begin(115200);

    pinMode(Entrada_configuracion, INPUT_PULLUP);

    Valor_entrada_configuracion = digitalRead(Entrada_configuracion);
    Serial.print("Estado configuracion: ");
    Serial.print(Valor_entrada_configuracion);

    // Initialize LittleFS
    if (!LittleFS.begin())
    {
        Serial.println("An Error has occurred while mounting LittleFS");
        return;
    }

    if (Valor_entrada_configuracion == HIGH)
    {
        conf = true;
    }
    else
    {
        conf = false;
    }

    if (conf == true)
    {
        // Inicializa Hotspot
        for (int i = 0; i <= 3; i++)
        {
            pinMode(Salida[i], OUTPUT);
            digitalWrite(Salida[i], LOW);
        }

        WiFi.softAP(ssidhs, passwordhs);
        IPAddress IP = WiFi.softAPIP();
        Serial.print("AP IP address: ");
        Serial.println(IP);

        String ssida = readFile(LittleFS, "/inputssid.txt");
        String passworda = readFile(LittleFS, "/inputpassword.txt");
        ssid = ssida.c_str();
        password = passworda.c_str();
        estado=Estados::Configuracion;
        servidorhttp();
    }

    else
    {
        String ssida = readFile(LittleFS, "/inputssid.txt");
        String passworda = readFile(LittleFS, "/inputpassword.txt");
        String servidor_MQTTa = readFile(LittleFS, "/servidor_MQTT.txt");
        String puerto_MQTTa = readFile(LittleFS, "/puerto_MQTT.txt");
        String dispositivoa = readFile(LittleFS, "/dispositivo.txt");
        String tiempo_inicioa = readFile(LittleFS, "/tiempo_inicio.txt");
        String duraciona[4] = {"a", "d", "d", "f"};

           for (int i = 0; i <= 3; i++)
        {
            String nombre = "/duracion_" + String(i) + ".txt";
            duraciona[i] = readFile(LittleFS, nombre.c_str());
        }

        String cicloa = readFile(LittleFS, "/ciclo.txt");
        Tiempo_inicio = atol(tiempo_inicioa.c_str());

        for (int i = 0; i <= 3; i++)
        {
            Duracion[i] = atol(duraciona[i].c_str());
            Duracion[i] = Duracion[i] * minutos;
        }

        Ciclo = atol(cicloa.c_str());
        Tiempo_inicio = Tiempo_inicio * minutos;
        Ciclo = Ciclo * horas;
        ssid = ssida.c_str();
        password = passworda.c_str();
        int str_len = servidor_MQTTa.length() + 1;
        char n1[str_len];
        servidor_MQTTa.toCharArray(n1, str_len);

        Serial.print("n1: ");
        Serial.println(n1);

        numero_puerto_MQTT = puerto_MQTTa.toInt();
        nombre_dispositivo = dispositivoa.c_str();

        setup_wifi();

        for (int i = 0; i <= 3; i++)
        {
            nombre_completo_salida[i] = String(nombre_dispositivo) + "/" + "salida_" + String(i);
            nombre_completo_duracion[i] = String(nombre_dispositivo) + "/" + "duracion_" + String(i);
            s1c[i] = nombre_completo_salida[i] + "c";

            pinMode(Salida[i], OUTPUT);
            digitalWrite(Salida[i], LOW);
        }

        nombre_estado = String(nombre_dispositivo) + "/" + "estado";
        nombre_completo_salida_general = String(nombre_dispositivo) + "/" + "general";
        nombre_completo_tiempo_inicio = String(nombre_dispositivo) + "/" + "tiempo_inicio";
        nombre_completo_ciclo = String(nombre_dispositivo) + "/" + "ciclo";
        nombre_completo_stop = String(nombre_dispositivo) + "/" + "stop";

        client.setServer(nmqtt, numero_puerto_MQTT);
        client.setCallback(callback);

        pinMode(Entrada_configuracion, INPUT_PULLUP);

