pablotg43/Riego-ESP8266/src/main.cpp
        temp_inicio = millis();

        servidorhttp();
        proximoEstado();
    }
}

void comms()
{
    temp_comms = now;

    for (int i = 0; i <= 3; i++)
    {
        Serial.println(nombre_completo_duracion[i]);
        Serial.println(Duracion[i]);
    }
    Serial.println("Inicio Reporte");
    Serial.println(estado);
    Serial.println(nombre_estado);
    Serial.println(nombre_completo_salida_general);
    Serial.println(nombre_completo_ciclo);
    Serial.println(Ciclo);
    Serial.println(nombre_completo_tiempo_inicio);
    Serial.println(Tiempo_inicio);

    unsigned long t1 = Tiempo_inicio / minutos;
    unsigned long t2[4] = {};
    unsigned long t3 = Ciclo / horas;
    String c[4] = {};
    String sa = nombre_estado + "c";
    String sc[4] = {};

    for (int i = 0; i <= 3; i++)
    {
        t2[i] = Duracion[i] / minutos;
        c[i] = (String)t2[i];
        sc[i] = nombre_completo_duracion[i] + "c";
    }
    String a = (String)estado;
    String b = (String)t1;
    String d = (String)t3;

    String sb = nombre_completo_tiempo_inicio + "c";
    String sd = nombre_completo_ciclo + "c";

    for (int i = 0; i <= 3; i++)
    {
        client.publish(sc[i].c_str(), c[i].c_str());        // Actualiza duración salidas
        client.publish(s1c[i].c_str(), s1ctext[i].c_str()); // Actualiza estado salidas
    }

    client.publish(sa.c_str(), a.c_str());
    client.publish(sb.c_str(), b.c_str());
    client.publish(sd.c_str(), d.c_str());
}

void loop()
{
    Valor_entrada_configuracion = digitalRead(Entrada_configuracion);

    if (Valor_entrada_configuracion == true)
    {
        Serial.println("En Configuración");
        delay(1000);
    }
    else
    {
        if (!client.connected())
        {
            reconnect();
        }
        client.loop();

        now = millis();

        if (now - temp_comms > 10000) // Lazo envío estado
        {
            comms();
        }

        switch (estado)
        {
            case Estados::Reposo:
                if (primera_vez)
                {
                    //Estado
                    digitalWrite(Salida[0], LOW);
                    digitalWrite(Salida[1], LOW);
                    digitalWrite(Salida[2], LOW);
                    digitalWrite(Salida[3], LOW);
                    primera_vez=false;
                    Serial.println("Cambiando " + nombre_completo_salida[0] + " a: off");
                    Serial.println("Cambiando " + nombre_completo_salida[1] + " a: off");
                    Serial.println("Cambiando " + nombre_completo_salida[2] + " a: off");
                    Serial.println("Cambiando " + nombre_completo_salida[3] + " a: off");
                    s1ctext[0] = "off";
                    s1ctext[1] = "off";
                    s1ctext[2] = "off";
                    s1ctext[3] = "off";
                    client.publish(s1c[0].c_str(), s1ctext[0].c_str());                
                    client.publish(s1c[1].c_str(), s1ctext[1].c_str());                
                    client.publish(s1c[2].c_str(), s1ctext[2].c_str());                
                    client.publish(s1c[3].c_str(), s1ctext[3].c_str());                
                }
                //Cambio por tiempo
                
                break;

            case Estados::Riego_1:
                if (primera_vez)
                {
                    //Estado
                    digitalWrite(Salida[0], HIGH);
                    digitalWrite(Salida[1], LOW);
                    digitalWrite(Salida[2], LOW);
                    digitalWrite(Salida[3], LOW);
                    primera_vez=false;
                    Serial.println("Cambiando " + nombre_completo_salida[0] + " a: on");
                    Serial.println("Cambiando " + nombre_completo_salida[1] + " a: off");
                    Serial.println("Cambiando " + nombre_completo_salida[2] + " a: off");
                    Serial.println("Cambiando " + nombre_completo_salida[3] + " a: off");
                    s1ctext[0] = "on";
                    s1ctext[1] = "off";
                    s1ctext[2] = "off";
                    s1ctext[3] = "off";
                    client.publish(s1c[0].c_str(), s1ctext[0].c_str());                
                    client.publish(s1c[1].c_str(), s1ctext[1].c_str());                
                    client.publish(s1c[2].c_str(), s1ctext[2].c_str());                
                    client.publish(s1c[3].c_str(), s1ctext[3].c_str());                    }
                //Cambio por tiempo
                if (now - temp_estado > Duracion[0]) { 
                    temp_estado=now;
                    proximoEstado(); 
                }

                break;

            case Estados::Riego_2:
                if (primera_vez)
                {                
                    //Estado
                    digitalWrite(Salida[0], LOW);
                    digitalWrite(Salida[1], HIGH);
                    digitalWrite(Salida[2], LOW);
                    digitalWrite(Salida[3], LOW);
                    primera_vez=false;
                    Serial.println("Cambiando " + nombre_completo_salida[0] + " a: off");
                    Serial.println("Cambiando " + nombre_completo_salida[1] + " a: on");
                    Serial.println("Cambiando " + nombre_completo_salida[2] + " a: off");
                    Serial.println("Cambiando " + nombre_completo_salida[3] + " a: off");
                    s1ctext[0] = "off";
                    s1ctext[1] = "on";
                    s1ctext[2] = "off";
                    s1ctext[3] = "off";
                    client.publish(s1c[0].c_str(), s1ctext[0].c_str());                
                    client.publish(s1c[1].c_str(), s1ctext[1].c_str());                
                    client.publish(s1c[2].c_str(), s1ctext[2].c_str());                
                    client.publish(s1c[3].c_str(), s1ctext[3].c_str());                    }
                //Cambio por tiempo
                if (now - temp_estado > Duracion[1]) { 
                    temp_estado=now;
                    proximoEstado(); 
                }                
                break;

            case Estados::Riego_3:
                if (primera_vez)
                {
                    //Estado
                    digitalWrite(Salida[0], LOW);
                    digitalWrite(Salida[1], LOW);
                    digitalWrite(Salida[2], HIGH);
                    digitalWrite(Salida[3], LOW);
                    primera_vez=false;
                    Serial.println("Cambiando " + nombre_completo_salida[0] + " a: off");
                    Serial.println("Cambiando " + nombre_completo_salida[1] + " a: off");
                    Serial.println("Cambiando " + nombre_completo_salida[2] + " a: on");
                    Serial.println("Cambiando " + nombre_completo_salida[3] + " a: off");
                    s1ctext[0] = "off";
                    s1ctext[1] = "off";
                    s1ctext[2] = "on";
                    s1ctext[3] = "off";
                    client.publish(s1c[0].c_str(), s1ctext[0].c_str());                
                    client.publish(s1c[1].c_str(), s1ctext[1].c_str());                
                    client.publish(s1c[2].c_str(), s1ctext[2].c_str());                
                    client.publish(s1c[3].c_str(), s1ctext[3].c_str());                    }
                //Cambio por tiempo
                if (now - temp_estado > Duracion[2]) { 
                    temp_estado=now;
                    proximoEstado(); 
                }                
                break;

            case Estados::Riego_4:
                if (primera_vez)
                {                
                    //Estado
                    digitalWrite(Salida[0], LOW);
                    digitalWrite(Salida[1], LOW);
                    digitalWrite(Salida[2], LOW);
                    digitalWrite(Salida[3], HIGH);
                    primera_vez=false;
                    Serial.println("Cambiando " + nombre_completo_salida[0] + " a: off");
                    Serial.println("Cambiando " + nombre_completo_salida[1] + " a: off");
                    Serial.println("Cambiando " + nombre_completo_salida[2] + " a: off");
                    Serial.println("Cambiando " + nombre_completo_salida[3] + " a: on");
                    s1ctext[0] = "off";
                    s1ctext[1] = "off";
                    s1ctext[2] = "off";
                    s1ctext[3] = "on";
                    client.publish(s1c[0].c_str(), s1ctext[0].c_str());                
                    client.publish(s1c[1].c_str(), s1ctext[1].c_str());                
                    client.publish(s1c[2].c_str(), s1ctext[2].c_str());                
                    client.publish(s1c[3].c_str(), s1ctext[3].c_str());                    }
                //Cambio por tiempo
                if (now - temp_estado > Duracion[3]) { 
                    temp_estado=now;
                    proximoEstado(); 
                }                
                break;

